{"xml": {"records": 
    {"record": [
            {"database": {"@name": "biblio.enl", "@path": "biblio.enl", "#text": "biblio.enl"}, "ref-type": {"@name": "Journal Article", "#text": "0"}, "contributors": {"authors": {"author": "Diaz"}}, "titles": {"title": "Inertial pocket navigation system: Unaided 3D positioning", "secondary-title": "Sensors (Switzerland)"}, "periodical": {"full-title": "Sensors (Switzerland)"}, "pages": "9156-9178", "volume": "15", "issue": "4", "keywords": {"keyword": ["Activity", "Attitude", "Dead reckoning", "Orientation", "Pedestrian", "Pitch", "Step detector", "Step length", "Vertical displacement"]}, "dates": {"year": "2015"}, "accession-num": "25897501", "electronic-resource-num": "10.3390/s150409156", "urls": {"pdf-urls": {"url": "internal-pdf://inertial-tecno.pdf"}}, "abstract": "Inertial navigation systems use dead-reckoning to estimate the pedestrian's position. There are two types of pedestrian dead-reckoning, the strapdown algorithm and the step-and-heading approach. Unlike the strapdown algorithm, which consists of the double integration of the three orthogonal accelerometer readings, the step-and-heading approach lacks the vertical displacement estimation. We propose the first step-and-heading approach based on unaided inertial data solving 3D positioning. We present a step detector for steps up and down and a novel vertical displacement estimator. Our navigation system uses the sensor introduced in the front pocket of the trousers, a likely location of a smartphone. The proposed algorithms are based on the opening angle of the leg or pitch angle. We analyzed our step detector and compared it with the state-of-the-art, as well as our already proposed step length estimator. Lastly, we assessed our vertical displacement estimator in a real-world scenario. We found that our algorithms outperform the literature step and heading algorithms and solve 3D positioning using unaided inertial data. Additionally, we found that with the pitch angle, five activities are distinguishable: standing, sitting, walking, walking up stairs and walking down stairs. This information complements the pedestrian location and is of interest for applications, such as elderly care."}, 
    
            {"database": {"@name": "biblio.enl", "@path": "biblio.enl", "#text": "biblio.enl"}, "ref-type": {"@name": "Journal Article", "#text": "0"}, "contributors": {"authors": {"author": ["Schauer, Lorenz", "Dorfmeister, Florian", "Maier, Marco"]}}, "titles": {"title": "Potentials and limitations of WIFI-positioning using time-of-flight", "secondary-title": "2013 International Conference on Indoor Positioning and Indoor Navigation, IPIN 2013"}, "periodical": {"full-title": "2013 International Conference on Indoor Positioning and Indoor Navigation, IPIN 2013"}, "pages": "28-31", "issue": "October", "keywords": null, "dates": {"year": "2013"}, "isbn": "9781479940431", "electronic-resource-num": "10.1109/IPIN.2013.6817861", "urls": {"pdf-urls": {"url": "internal-pdf://ToFPdf.pdf"}}, "abstract": "Many existing approaches for WIFI-based indoor positioning systems use the received signal strength indicator (RSSI) of all the access points in reach to estimate the current location of a mobile device. Those systems' accuracy, however, is strongly influenced by external interferences and suffers both from short-term and long-term changes in the respective environments. Time-of-Flight-based (TOF) approaches bypass these problems by relying on the relation between distance and the time it takes a radio signal to travel that distance. Furthermore and in contrast to RSSI-based fingerprinting methods, they require neither a time-consuming calibration phase nor an extensive database. In this paper, we assess the advantages and limitations of TOF-based positioning techniques and compare different approaches in literature in terms of communication flow, hardware components, method of time measurement and positioning accuracy. Additionally, we present a novel approach using NULL-ACK-sequences, off-the-shelf hardware components and the CPU's time stamp counter offering a nanosecond resolution. An association with access points is hence not required and there is no need for modifications of client or infrastructure WIFI-components. We evaluate our system in various settings. Our results indicate that the accuracy of such TOF-based approaches depends on both the used hardware and the characteristics of the given environment. We find that time fluctuations caused by varying delays of the interrupt service routine as well as multipath effects render precise distance estimations based on a single measurement infeasible. In order to obtain stable ranging results we try to minimize these effects by utilizing a high amount of NULL-ACK-sequences. We investigate several filters and statistical estimations and compare them within our system settings. Using a band-pass filter and taking the average of a series of measurements, we are able to achieve a ranging accuracy with a mean ab- olute error of less than 1.33 meters in an ideal environment."},
        
            {"database": {"@name": "biblio.enl", "@path": "biblio.enl", "#text": "biblio.enl"}, "ref-type": {"@name": "Journal Article", "#text": "0"}, "contributors": {"authors": {"author": ["Correa, Alejandro", "Barcelo, Marc", "Morell, Antoni", "Vicario, Jose Lopez"]}}, "titles": {"title": "A review of pedestrian indoor positioning systems for mass market applications", "secondary-title": "Sensors (Switzerland)"}, "periodical": {"full-title": "Sensors (Switzerland)"}, "volume": "17", "issue": "8", "keywords": {"keyword": ["Indoor localization", "Indoor location based services", "Navigation", "Pedestrian tracking"]}, "dates": {"year": "2017"}, "accession-num": "28829386", "electronic-resource-num": "10.3390/s17081927", "urls": {"pdf-urls": {"url": "internal-pdf://sensors-17-01927.pdf"}}, "abstract": "In the last decade, the interest in Indoor Location Based Services (ILBS) has increased stimulating the development of Indoor Positioning Systems (IPS). In particular, ILBS look for positioning systems that can be applied anywhere in the world for millions of users, that is, there is a need for developing IPS for mass market applications. Those systems must provide accurate position estimations with minimum infrastructure cost and easy scalability to different environments. This survey overviews the current state of the art of IPSs and classifies them in terms of the infrastructure and methodology employed. Finally, each group is reviewed analysing its advantages and disadvantages and its applicability to mass market applications. Keywords:"}, 
        
            {"database": {"@name": "biblio.enl", "@path": "biblio.enl", "#text": "biblio.enl"}, "ref-type": {"@name": "Journal Article", "#text": "0"}, "contributors": {"authors": {"author": "Zanella, Andrea"}}, "titles": {"title": "Best practice in RSS measurements and ranging", "secondary-title": "IEEE Communications Surveys and Tutorials"}, "periodical": {"full-title": "IEEE Communications Surveys and Tutorials"}, "pages": "2662-2686", "volume": "18", "issue": "4", "keywords": {"keyword": ["802.15.4", "Communications technology", "Indoor", "Localization", "Measurements", "Outdoor", "RSS", "RSSI", "Radio signal strength", "Ranging", "Zigbee"]}, "dates": {"year": "2016"}, "electronic-resource-num": "10.1109/COMST.2016.2553452", "urls": {"pdf-urls": {"url": "internal-pdf://RSS-pdf.pdf"}}, "abstract": "—The term \" ranging \" is often used to indicate the operations that make it possible to estimate the distance between two nodes by processing some signals generated and/or received by the nodes. In wireless systems, a very popular ranging method makes use of the Radio Signal Strength (RSS), which is a measure of the received radio signal power. However, RSS-based ranging is considered very inaccurate, particularly in indoor environments, mainly because of the randomness of the received signal power. In this tutorial paper, we provide an in-depth analysis of the main factors that affect the variability of the received signal power and the accuracy of the RSS measurements. Starting from a survey of the most common and widely accepted models for the radio signal propagation and the RSS-based ranging, we then focus our attention on some technological and proce-dural pitfalls that are often overlooked, but may significantly affect the accuracy of the RSS-based ranging, and we suggest possible techniques to alleviate such problems. The theoretical argumentation is backed up by a set of empirical results in different scenarios. We conclude the paper by providing some best-practice recommendations for proper RSS-based ranging estimation in wireless networks and discussing new approaches and open research challenges."}
        ]
    }
}
}